Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz4010ca80208.h
#define PIN_PE07B_ADC_VINP11                       _UINT32_(135)
#define MUX_PE07B_ADC_VINP11                       _UINT32_(1) 
#define PINMUX_PE07B_ADC_VINP11                    ((PIN_PE07B_ADC_VINP11 << 16) | MUX_PE07B_ADC_VINP11)
#define PORT_PE07B_ADC_VINP11                      (_UINT32_(1) << 7)

#define PIN_PE08B_ADC_VINP12                       _UINT32_(136)
#define MUX_PE08B_ADC_VINP12                       _UINT32_(1) 
#define PINMUX_PE08B_ADC_VINP12                    ((PIN_PE08B_ADC_VINP12 << 16) | MUX_PE08B_ADC_VINP12)
#define PORT_PE08B_ADC_VINP12                      (_UINT32_(1) << 8)

#define PIN_PE09B_ADC_VINP13                       _UINT32_(137)
#define MUX_PE09B_ADC_VINP13                       _UINT32_(1) 
#define PINMUX_PE09B_ADC_VINP13                    ((PIN_PE09B_ADC_VINP13 << 16) | MUX_PE09B_ADC_VINP13)
#define PORT_PE09B_ADC_VINP13                      (_UINT32_(1) << 9)

#define PIN_PE10B_ADC_VINP14                       _UINT32_(138)
#define MUX_PE10B_ADC_VINP14                       _UINT32_(1) 
#define PINMUX_PE10B_ADC_VINP14                    ((PIN_PE10B_ADC_VINP14 << 16) | MUX_PE10B_ADC_VINP14)
#define PORT_PE10B_ADC_VINP14                      (_UINT32_(1) << 10)

#define PIN_PE11B_ADC_VINP15                       _UINT32_(139)
#define MUX_PE11B_ADC_VINP15                       _UINT32_(1) 
#define PINMUX_PE11B_ADC_VINP15                    ((PIN_PE11B_ADC_VINP15 << 16) | MUX_PE11B_ADC_VINP15)
#define PORT_PE11B_ADC_VINP15                      (_UINT32_(1) << 11)

#define PIN_PA18B_ADC_VINP16                       _UINT32_(18)
#define MUX_PA18B_ADC_VINP16                       _UINT32_(1) 
#define PINMUX_PA18B_ADC_VINP16                    ((PIN_PA18B_ADC_VINP16 << 16) | MUX_PA18B_ADC_VINP16)
#define PORT_PA18B_ADC_VINP16                      (_UINT32_(1) << 18)

#define PIN_PA17B_ADC_VINP17                       _UINT32_(17)
#define MUX_PA17B_ADC_VINP17                       _UINT32_(1) 
#define PINMUX_PA17B_ADC_VINP17                    ((PIN_PA17B_ADC_VINP17 << 16) | MUX_PA17B_ADC_VINP17)
#define PORT_PA17B_ADC_VINP17                      (_UINT32_(1) << 17)

#define PIN_PA16B_ADC_VINP18                       _UINT32_(16)
#define MUX_PA16B_ADC_VINP18                       _UINT32_(1) 
#define PINMUX_PA16B_ADC_VINP18                    ((PIN_PA16B_ADC_VINP18 << 16) | MUX_PA16B_ADC_VINP18)
#define PORT_PA16B_ADC_VINP18                      (_UINT32_(1) << 16)

#define PIN_PA15B_ADC_VINP19                       _UINT32_(15)
#define MUX_PA15B_ADC_VINP19                       _UINT32_(1) 
#define PINMUX_PA15B_ADC_VINP19                    ((PIN_PA15B_ADC_VINP19 << 16) | MUX_PA15B_ADC_VINP19)
#define PORT_PA15B_ADC_VINP19                      (_UINT32_(1) << 15)

#define PIN_PA29B_ADC_VINP20                       _UINT32_(29)
#define MUX_PA29B_ADC_VINP20                       _UINT32_(1) 
#define PINMUX_PA29B_ADC_VINP20                    ((PIN_PA29B_ADC_VINP20 << 16) | MUX_PA29B_ADC_VINP20)
#define PORT_PA29B_ADC_VINP20                      (_UINT32_(1) << 29)

#define PIN_PA28B_ADC_VINP21                       _UINT32_(28)
#define MUX_PA28B_ADC_VINP21                       _UINT32_(1) 
#define PINMUX_PA28B_ADC_VINP21                    ((PIN_PA28B_ADC_VINP21 << 16) | MUX_PA28B_ADC_VINP21)
#define PORT_PA28B_ADC_VINP21                      (_UINT32_(1) << 28)

#define PIN_PA14B_ADC_VINP24                       _UINT32_(14)
#define MUX_PA14B_ADC_VINP24                       _UINT32_(1) 
#define PINMUX_PA14B_ADC_VINP24                    ((PIN_PA14B_ADC_VINP24 << 16) | MUX_PA14B_ADC_VINP24)
#define PORT_PA14B_ADC_VINP24                      (_UINT32_(1) << 14)

#define PIN_PA13B_ADC_VINP25                       _UINT32_(13)
#define MUX_PA13B_ADC_VINP25                       _UINT32_(1) 
#define PINMUX_PA13B_ADC_VINP25                    ((PIN_PA13B_ADC_VINP25 << 16) | MUX_PA13B_ADC_VINP25)
#define PORT_PA13B_ADC_VINP25                      (_UINT32_(1) << 13)

#define PIN_PA12B_ADC_VINP26                       _UINT32_(12)
#define MUX_PA12B_ADC_VINP26                       _UINT32_(1) 
#define PINMUX_PA12B_ADC_VINP26                    ((PIN_PA12B_ADC_VINP26 << 16) | MUX_PA12B_ADC_VINP26)
#define PORT_PA12B_ADC_VINP26                      (_UINT32_(1) << 12)

#define PIN_PA11B_ADC_VINP27                       _UINT32_(11)
#define MUX_PA11B_ADC_VINP27                       _UINT32_(1) 
#define PINMUX_PA11B_ADC_VINP27                    ((PIN_PA11B_ADC_VINP27 << 16) | MUX_PA11B_ADC_VINP27)
#define PORT_PA11B_ADC_VINP27                      (_UINT32_(1) << 11)

#define PIN_PA27B_ADC_VINP28                       _UINT32_(27)
#define MUX_PA27B_ADC_VINP28                       _UINT32_(1) 
#define PINMUX_PA27B_ADC_VINP28                    ((PIN_PA27B_ADC_VINP28 << 16) | MUX_PA27B_ADC_VINP28)
#define PORT_PA27B_ADC_VINP28                      (_UINT32_(1) << 27)

#define PIN_PA26B_ADC_VINP29                       _UINT32_(26)
#define MUX_PA26B_ADC_VINP29                       _UINT32_(1) 
#define PINMUX_PA26B_ADC_VINP29                    ((PIN_PA26B_ADC_VINP29 << 16) | MUX_PA26B_ADC_VINP29)
#define PORT_PA26B_ADC_VINP29                      (_UINT32_(1) << 26)

#define PIN_PA10B_ADC_VINP32                       _UINT32_(10)
#define MUX_PA10B_ADC_VINP32                       _UINT32_(1) 
#define PINMUX_PA10B_ADC_VINP32                    ((PIN_PA10B_ADC_VINP32 << 16) | MUX_PA10B_ADC_VINP32)
#define PORT_PA10B_ADC_VINP32                      (_UINT32_(1) << 10)

#define PIN_PA09B_ADC_VINP33                       _UINT32_(9) 
#define MUX_PA09B_ADC_VINP33                       _UINT32_(1) 
#define PINMUX_PA09B_ADC_VINP33                    ((PIN_PA09B_ADC_VINP33 << 16) | MUX_PA09B_ADC_VINP33)
#define PORT_PA09B_ADC_VINP33                      (_UINT32_(1) << 9)

#define PIN_PA08B_ADC_VINP34                       _UINT32_(8) 
#define MUX_PA08B_ADC_VINP34                       _UINT32_(1) 
#define PINMUX_PA08B_ADC_VINP34                    ((PIN_PA08B_ADC_VINP34 << 16) | MUX_PA08B_ADC_VINP34)
#define PORT_PA08B_ADC_VINP34                      (_UINT32_(1) << 8)

#define PIN_PA07B_ADC_VINP35                       _UINT32_(7) 
#define MUX_PA07B_ADC_VINP35                       _UINT32_(1) 
#define PINMUX_PA07B_ADC_VINP35                    ((PIN_PA07B_ADC_VINP35 << 16) | MUX_PA07B_ADC_VINP35)
#define PORT_PA07B_ADC_VINP35                      (_UINT32_(1) << 7)

#define PIN_PA25B_ADC_VINP36                       _UINT32_(25)
#define MUX_PA25B_ADC_VINP36                       _UINT32_(1) 
#define PINMUX_PA25B_ADC_VINP36                    ((PIN_PA25B_ADC_VINP36 << 16) | MUX_PA25B_ADC_VINP36)
#define PORT_PA25B_ADC_VINP36                      (_UINT32_(1) << 25)

#define PIN_PA24B_ADC_VINP37                       _UINT32_(24)
#define MUX_PA24B_ADC_VINP37                       _UINT32_(1) 
#define PINMUX_PA24B_ADC_VINP37                    ((PIN_PA24B_ADC_VINP37 << 16) | MUX_PA24B_ADC_VINP37)
#define PORT_PA24B_ADC_VINP37                      (_UINT32_(1) << 24)

/* ========== PORT definition for BSDAP peripheral ========== */
#define PIN_PC20G_BSDAP_TCK_SWCLK                  _UINT32_(84)
#define MUX_PC20G_BSDAP_TCK_SWCLK                  _UINT32_(6) 
#define PINMUX_PC20G_BSDAP_TCK_SWCLK               ((PIN_PC20G_BSDAP_TCK_SWCLK << 16) | MUX_PC20G_BSDAP_TCK_SWCLK)
#define PORT_PC20G_BSDAP_TCK_SWCLK                 (_UINT32_(1) << 20)

