Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz4010ca80208.h
#define PIN_PC24E_EBI_A23                          _UINT32_(88)
#define MUX_PC24E_EBI_A23                          _UINT32_(4) 
#define PINMUX_PC24E_EBI_A23                       ((PIN_PC24E_EBI_A23 << 16) | MUX_PC24E_EBI_A23)
#define PORT_PC24E_EBI_A23                         (_UINT32_(1) << 24)

#define PIN_PD13E_EBI_D0                           _UINT32_(109)
#define MUX_PD13E_EBI_D0                           _UINT32_(4) 
#define PINMUX_PD13E_EBI_D0                        ((PIN_PD13E_EBI_D0 << 16) | MUX_PD13E_EBI_D0)
#define PORT_PD13E_EBI_D0                          (_UINT32_(1) << 13)

#define PIN_PD23E_EBI_D1                           _UINT32_(119)
#define MUX_PD23E_EBI_D1                           _UINT32_(4) 
#define PINMUX_PD23E_EBI_D1                        ((PIN_PD23E_EBI_D1 << 16) | MUX_PD23E_EBI_D1)
#define PORT_PD23E_EBI_D1                          (_UINT32_(1) << 23)

#define PIN_PD14E_EBI_D2                           _UINT32_(110)
#define MUX_PD14E_EBI_D2                           _UINT32_(4) 
#define PINMUX_PD14E_EBI_D2                        ((PIN_PD14E_EBI_D2 << 16) | MUX_PD14E_EBI_D2)
#define PORT_PD14E_EBI_D2                          (_UINT32_(1) << 14)

#define PIN_PD02E_EBI_D3                           _UINT32_(98)
#define MUX_PD02E_EBI_D3                           _UINT32_(4) 
#define PINMUX_PD02E_EBI_D3                        ((PIN_PD02E_EBI_D3 << 16) | MUX_PD02E_EBI_D3)
#define PORT_PD02E_EBI_D3                          (_UINT32_(1) << 2)

#define PIN_PD15E_EBI_D4                           _UINT32_(111)
#define MUX_PD15E_EBI_D4                           _UINT32_(4) 
#define PINMUX_PD15E_EBI_D4                        ((PIN_PD15E_EBI_D4 << 16) | MUX_PD15E_EBI_D4)
#define PORT_PD15E_EBI_D4                          (_UINT32_(1) << 15)

#define PIN_PD03E_EBI_D5                           _UINT32_(99)
#define MUX_PD03E_EBI_D5                           _UINT32_(4) 
#define PINMUX_PD03E_EBI_D5                        ((PIN_PD03E_EBI_D5 << 16) | MUX_PD03E_EBI_D5)
#define PORT_PD03E_EBI_D5                          (_UINT32_(1) << 3)

#define PIN_PD16E_EBI_D6                           _UINT32_(112)
#define MUX_PD16E_EBI_D6                           _UINT32_(4) 
#define PINMUX_PD16E_EBI_D6                        ((PIN_PD16E_EBI_D6 << 16) | MUX_PD16E_EBI_D6)
#define PORT_PD16E_EBI_D6                          (_UINT32_(1) << 16)

#define PIN_PD17E_EBI_D7                           _UINT32_(113)
#define MUX_PD17E_EBI_D7                           _UINT32_(4) 
#define PINMUX_PD17E_EBI_D7                        ((PIN_PD17E_EBI_D7 << 16) | MUX_PD17E_EBI_D7)
#define PORT_PD17E_EBI_D7                          (_UINT32_(1) << 17)

#define PIN_PD04E_EBI_D8                           _UINT32_(100)
#define MUX_PD04E_EBI_D8                           _UINT32_(4) 
#define PINMUX_PD04E_EBI_D8                        ((PIN_PD04E_EBI_D8 << 16) | MUX_PD04E_EBI_D8)
#define PORT_PD04E_EBI_D8                          (_UINT32_(1) << 4)

#define PIN_PD18E_EBI_D9                           _UINT32_(114)
#define MUX_PD18E_EBI_D9                           _UINT32_(4) 
#define PINMUX_PD18E_EBI_D9                        ((PIN_PD18E_EBI_D9 << 16) | MUX_PD18E_EBI_D9)
#define PORT_PD18E_EBI_D9                          (_UINT32_(1) << 18)

#define PIN_PD19E_EBI_D10                          _UINT32_(115)
#define MUX_PD19E_EBI_D10                          _UINT32_(4) 
#define PINMUX_PD19E_EBI_D10                       ((PIN_PD19E_EBI_D10 << 16) | MUX_PD19E_EBI_D10)
#define PORT_PD19E_EBI_D10                         (_UINT32_(1) << 19)

#define PIN_PD05E_EBI_D11                          _UINT32_(101)
#define MUX_PD05E_EBI_D11                          _UINT32_(4) 
#define PINMUX_PD05E_EBI_D11                       ((PIN_PD05E_EBI_D11 << 16) | MUX_PD05E_EBI_D11)
#define PORT_PD05E_EBI_D11                         (_UINT32_(1) << 5)

#define PIN_PD06E_EBI_D12                          _UINT32_(102)
#define MUX_PD06E_EBI_D12                          _UINT32_(4) 
#define PINMUX_PD06E_EBI_D12                       ((PIN_PD06E_EBI_D12 << 16) | MUX_PD06E_EBI_D12)
#define PORT_PD06E_EBI_D12                         (_UINT32_(1) << 6)

#define PIN_PD20E_EBI_D13                          _UINT32_(116)
#define MUX_PD20E_EBI_D13                          _UINT32_(4) 
#define PINMUX_PD20E_EBI_D13                       ((PIN_PD20E_EBI_D13 << 16) | MUX_PD20E_EBI_D13)
#define PORT_PD20E_EBI_D13                         (_UINT32_(1) << 20)

#define PIN_PD21E_EBI_D14                          _UINT32_(117)
#define MUX_PD21E_EBI_D14                          _UINT32_(4) 
#define PINMUX_PD21E_EBI_D14                       ((PIN_PD21E_EBI_D14 << 16) | MUX_PD21E_EBI_D14)
#define PORT_PD21E_EBI_D14                         (_UINT32_(1) << 21)

#define PIN_PD07E_EBI_D15                          _UINT32_(103)
#define MUX_PD07E_EBI_D15                          _UINT32_(4) 
#define PINMUX_PD07E_EBI_D15                       ((PIN_PD07E_EBI_D15 << 16) | MUX_PD07E_EBI_D15)
#define PORT_PD07E_EBI_D15                         (_UINT32_(1) << 7)

#define PIN_PC23E_EBI_NBS0_A0                      _UINT32_(87)
#define MUX_PC23E_EBI_NBS0_A0                      _UINT32_(4) 
#define PINMUX_PC23E_EBI_NBS0_A0                   ((PIN_PC23E_EBI_NBS0_A0 << 16) | MUX_PC23E_EBI_NBS0_A0)
#define PORT_PC23E_EBI_NBS0_A0                     (_UINT32_(1) << 23)

#define PIN_PC06E_EBI_NBS1_NWR1                    _UINT32_(70)
#define MUX_PC06E_EBI_NBS1_NWR1                    _UINT32_(4) 
#define PINMUX_PC06E_EBI_NBS1_NWR1                 ((PIN_PC06E_EBI_NBS1_NWR1 << 16) | MUX_PC06E_EBI_NBS1_NWR1)
#define PORT_PC06E_EBI_NBS1_NWR1                   (_UINT32_(1) << 6)

#define PIN_PC20E_EBI_NBS2_NWR2_A1                 _UINT32_(84)
#define MUX_PC20E_EBI_NBS2_NWR2_A1                 _UINT32_(4) 
#define PINMUX_PC20E_EBI_NBS2_NWR2_A1              ((PIN_PC20E_EBI_NBS2_NWR2_A1 << 16) | MUX_PC20E_EBI_NBS2_NWR2_A1)
#define PORT_PC20E_EBI_NBS2_NWR2_A1                (_UINT32_(1) << 20)

#define PIN_PC08E_EBI_NCS0                         _UINT32_(72)
#define MUX_PC08E_EBI_NCS0                         _UINT32_(4) 
#define PINMUX_PC08E_EBI_NCS0                      ((PIN_PC08E_EBI_NCS0 << 16) | MUX_PC08E_EBI_NCS0)
#define PORT_PC08E_EBI_NCS0                        (_UINT32_(1) << 8)

#define PIN_PC07E_EBI_NCS1                         _UINT32_(71)
#define MUX_PC07E_EBI_NCS1                         _UINT32_(4) 
#define PINMUX_PC07E_EBI_NCS1                      ((PIN_PC07E_EBI_NCS1 << 16) | MUX_PC07E_EBI_NCS1)
#define PORT_PC07E_EBI_NCS1                        (_UINT32_(1) << 7)

